@extends('layouts.page')


@section('body.main')
    <main class="legal pb-4">
        <div class="space-y-1">
            <h1 class="text-xl sm:text-2xl md:text-3xl text-foreground font-bold">Політика конфіденційності</h1>
            <div class="text-xs text-muted font-medium flex items-center gap-2">
                <i class="fi fi-rr-calendar"></i>
                <div>Оновлено: 1 липня 2025</div>
            </div>
        </div>
        <section>
            <p>Ця сторінка пояснює, яку інформацію може збирати вебсайт і браузерне розширення Movie Timecode, з якою метою
                та як вона використовується. Використання сайту або браузерного розширення означає автоматичну згоду з цією
                політикою.</p>
        </section>
        <section>
            <h3>Збір інформації</h3>
            <p>Movie Timecode не збирає жодних персональних даних користувачів, окрім випадків, коли користувач самостійно
                проходить авторизацію через Twitch. У такому разі буде зібрана лише необхідну інформацію про обліковий
                запис: ID користувача та username.</p>
            <p>Під час використання функцій розширення інші користувачі можуть бачити ваш username, однак ID користувача, який був отриманий з Twitch, залишається недоступним для інших користувачів.</p>
            <p>Окрім цього, важливо зазначити, що жодна інформація, яка може надати доступ до управління обліковими
                записами, зокрема Twitch, не зберігається.</p>
            <h4>Технічні дані</h4>
            <p>Під час користування сайтом і браузерним розширенням браузер автоматично передає певні технічні дані, такі як
                IP-адреса, User Agent <i>(інформація про браузер і пристрій)</i>. Ці дані можуть оброблятися та в деяких
                випадках збиратися для забезпечення роботи сервісу, його покращення і захисту від зловживань.</p>
        </section>
        <section>
            <h3>Файли cookie</h3>
            <p>Файли cookie — це невеликі файли даних, які зберігаються на ваших пристроях під час відвідування будь-якого
                сайту. Вони допомагають сайту запам’ятовувати ваші налаштування та покращувати роботу сервісу.</p>
        </section>
        <section>
            <h3>Взаємодія розширення з сайтами</h3>
            <p>Браузерне розширення Movie Timecode має доступ і працює лише з певними сайтам, перелік яких чітко визначено в
                маніфесті розширення. До цих сайтів належать:</p>
            <ul>
                <li>Movie Timecode</li>
                <li>UAKino</li>
            </ul>
            <p>Ці обмеження можуть гарантувати, що розширення не взаємодіє з іншими ресурсами, забезпечуючи безпеку та
                належну роботу для користувачів.</p>
        </section>
        <section>
            <h3>Зміни до політики конфіденційності</h3>
            <p>Усі оновлення та зміни до цієї Політики конфіденційності будуть опубліковані на цій сторінці та набирають чинності з моменту їх публікації. </p>
        </section>
    </main>
@endsection
